# Package install

In [83]:
pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\administrator\.conda\envs\hda\lib\site-packages (2.9.3)Note: you may need to restart the kernel to use updated packages.

In [84]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\administrator\.conda\envs\hda\lib\site-packages (3.0.9)
Requirement already satisfied: et-xmlfile in c:\users\administrator\.conda\envs\hda\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

# Package call

In [85]:
import psycopg2
import pandas as pd
import psycopg2.extras
import psycopg2

# Extract

In [86]:
# df = "/Users/Administrator/Downloads/New folder/pdf/Intern/ecommerce_csv"

#### Reading trans_dim from csv file

In [87]:
df = 'C:/Users/Administrator/Downloads/New folder/pdf/Intern/'

In [88]:

# trans_dim = pd.read_csv("/Users/Administrator/Downloads/New folder/pdf/Intern/ecommerce_csv/Trans_dim.csv")
trans_dim = pd.read_excel(open(df + "e-commerece_data.xlsx","rb"), sheet_name=1, engine='openpyxl')

In [89]:
trans_dim.head()

  payment_key trans_type                         bank_name
0        P001       cash                              None
1        P002       card                   AB Bank Limited
2        P003       card  Bangladesh Commerce Bank Limited
3        P004       card                 Bank Asia Limited
4        P005       card                 BRAC Bank Limited

In [93]:
trans_dim.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39 entries, 0 to 38
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   payment_key  39 non-null     object
 1   trans_type   39 non-null     object
 2   bank_name    39 non-null     object
dtypes: object(3)
memory usage: 1.0+ KB

#### Reading store_df from csv file

In [90]:

store_df = pd.read_excel(open(df + "e-commerece_data.xlsx","rb"), sheet_name=5, engine='openpyxl')
# pd.read_csv("/Users/Administrator/Downloads/New folder/pdf/Intern/ecommerce_csv/Store_dim.csv")

In [91]:
store_df.head()

  store_key division  district         upazila
0     S0001   SYLHET  HABIGANJ      AJMIRIGANJ
1     S0002   SYLHET  HABIGANJ         BAHUBAL
2     S0003   SYLHET  HABIGANJ      BANIACHONG
3     S0004   SYLHET  HABIGANJ     CHUNARUGHAT
4     S0005   SYLHET  HABIGANJ  HABIGANJ SADAR

In [92]:
store_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 726 entries, 0 to 725
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   store_key  726 non-null    object
 1   division   726 non-null    object
 2   district   726 non-null    object
 3   upazila    726 non-null    object
dtypes: object(4)
memory usage: 22.8+ KB

In [97]:
store_df.isnull().sum()

store_key    0
division     0
district     0
upazila      0
dtype: int64

#### Reading item_dim from csv file

In [98]:

item_df = pd.read_excel(open(df + "e-commerece_data.xlsx","rb"), sheet_name=2, engine='openpyxl')
# pd.read_csv("/Users/Administrator/Downloads/New folder/pdf/Intern/ecommerce_csv/Item_dim.csv")
item_df.head()

,item_key,item_name,desc,unit_price,man_country,supplier,unit
0,I00001,A&W Root Beer - 12 oz cans,a. Beverage - Soda,11.50,Netherlands,Bolsius Boxmeer,cans
1,I00002,A&W Root Beer Diet - 12 oz cans,a. Beverage - Soda,6.75,poland,CHROMADURLIN S.A.S,cans
2,I00003,Barq's Root Beer - 12 oz cans,a. Beverage - Soda,6.75,Bangladesh,DENIMACH LTD,cans
3,I00004,Cherry Coke 12oz,a. Beverage - Soda,6.75,Netherlands,Bolsius Boxmeer,cans
4,I00005,Cherry Coke Zero 12 pack,a. Beverage - Soda,6.75,Finland,HARDFORD AB,cans

In [99]:
item_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264 entries, 0 to 263
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   item_key     264 non-null    object
 1   item_name    264 non-null    object
 2   desc         264 non-null    object
 3   unit_price   264 non-null    float64
 4   man_country  264 non-null    object
 5   supplier     264 non-null    object
 6   unit         263 non-null    object
dtypes: float64(1), object(6)
memory usage: 14.6+ KB

In [100]:
item_df.sum().isna()

C:\Users\ADMINI~1\AppData\Local\Temp/ipykernel_14244/3986604733.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  item_df.sum().isna()

item_key       False
item_name      False
desc           False
unit_price     False
man_country    False
supplier       False
dtype: bool

#### Customer table

In [101]:
customer_df = pd.read_excel(open(df + "e-commerece_data.xlsx","rb"), sheet_name=3, engine='openpyxl')
# pd.read_csv("/Users/Administrator/Downloads/New folder/pdf/Intern/ecommerce_csv/Coustomer_dim.csv")
customer_df.head()

  coustomer_key             name     contact_no            nid
0       C000001            sumit  8801920345851  7505075708899
1       C000002         tammanne  8801817069329  1977731324842
2       C000003    kailash kumar  8801663795774  3769494056318
3       C000004  bhagwati prasad  8801533627961  9378834712725
4       C000005             ajay  8801943715786  3540815556323

In [102]:
customer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9191 entries, 0 to 9190
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   coustomer_key  9191 non-null   object
 1   name           9164 non-null   object
 2   contact_no     9191 non-null   int64
 3   nid            9191 non-null   int64
dtypes: int64(2), object(2)
memory usage: 287.3+ KB

In [103]:
customer_df.isna().sum()

coustomer_key     0
name             27
contact_no        0
nid               0
dtype: int64

In [104]:
customer_df['name'].fillna('Null',inplace = True)

In [105]:
customer_df.isna().sum()

coustomer_key    0
name             0
contact_no       0
nid              0
dtype: int64

In [16]:
# customer_df.dropna(inplace = True)
# customer_df.isna().sum()

coustomer_key    0
name             0
contact_no       0
nid              0
dtype: int64

In [17]:
# customer_df['contact_no'] = customer_df['contact_no'].astype('Int64')

In [106]:
customer_df.iloc[:,2]

0       8801920345851
1       8801817069329
2       8801663795774
3       8801533627961
4       8801943715786
            ...
9186    8801563029753
9187    8801794982266
9188    8801890032435
9189    8801563290767
9190    8801524507359
Name: contact_no, Length: 9191, dtype: int64

In [107]:
customer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9191 entries, 0 to 9190
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   coustomer_key  9191 non-null   object
 1   name           9191 non-null   object
 2   contact_no     9191 non-null   int64
 3   nid            9191 non-null   int64
dtypes: int64(2), object(2)
memory usage: 287.3+ KB

In [20]:
# customer_df['nid'] = customer_df['nid'].astype('Int64')
# customer_df.iloc[:5,3]

0    7505080000000
1    1977730000000
2    3769490000000
3    9378830000000
4    3540820000000
Name: nid, dtype: Int64

### Time_dim table

In [108]:
time_df = pd.read_excel(open(df + "e-commerece_data.xlsx","rb"), sheet_name=4, engine='openpyxl')
# pd.read_csv("/Users/Administrator/Downloads/New folder/pdf/Intern/ecommerce_csv/Time_dim.csv")
time_df.head()

  time_key              date  hour  day      week  month quarter  year
0   T00001  20-05-2017 14:56    14   20  3rd Week      5      Q2  2017
1   T00002  30-01-2015 22:14    22   30  4th Week      1      Q1  2015
2   T00003  14-03-2020 02:34     2   14  2nd Week      3      Q1  2020
3   T00004  27-04-2018 12:19    12   27  4th Week      4      Q2  2018
4   T00005  14-04-2018 10:43    10   14  2nd Week      4      Q2  2018

In [109]:
time_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99999 entries, 0 to 99998
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   time_key  99999 non-null  object
 1   date      99999 non-null  object
 2   hour      99999 non-null  int64
 3   day       99999 non-null  int64
 4   week      99999 non-null  object
 5   month     99999 non-null  int64
 6   quarter   99999 non-null  object
 7   year      99999 non-null  int64
dtypes: int64(4), object(4)
memory usage: 6.1+ MB

In [110]:
time_df.isna().sum()

time_key    0
date        0
hour        0
day         0
week        0
month       0
quarter     0
year        0
dtype: int64

In [111]:
time_df['date'] = pd.to_datetime(time_df['date'],format = '%d-%m-%Y %H:%M')
time_df.head()

  time_key                date  hour  day      week  month quarter  year
0   T00001 2017-05-20 14:56:00    14   20  3rd Week      5      Q2  2017
1   T00002 2015-01-30 22:14:00    22   30  4th Week      1      Q1  2015
2   T00003 2020-03-14 02:34:00     2   14  2nd Week      3      Q1  2020
3   T00004 2018-04-27 12:19:00    12   27  4th Week      4      Q2  2018
4   T00005 2018-04-14 10:43:00    10   14  2nd Week      4      Q2  2018

In [116]:
time_df['date'] = pd.to_datetime(time_df['date'])
time_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99999 entries, 0 to 99998
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   time_key  99999 non-null  object
 1   date      99999 non-null  datetime64[ns]
 2   hour      99999 non-null  int64
 3   day       99999 non-null  int64
 4   week      99999 non-null  object
 5   month     99999 non-null  int64
 6   quarter   99999 non-null  object
 7   year      99999 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(3)
memory usage: 6.1+ MB

In [114]:
time_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99999 entries, 0 to 99998
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   time_key  99999 non-null  object
 1   date      99999 non-null  datetime64[ns]
 2   hour      99999 non-null  int64
 3   day       99999 non-null  int64
 4   week      99999 non-null  object
 5   month     99999 non-null  int64
 6   quarter   99999 non-null  object
 7   year      99999 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(3)
memory usage: 6.1+ MB

In [117]:
# fact_df = pd.read_csv("/Users/Administrator/HDA-Tech-Learning/notebook/e-commerece_data.csv")
# fact_df.head()

In [112]:
fact_df = pd.read_excel(open(df + "e-commerece_data.xlsx","rb"), sheet_name=0, engine='openpyxl')
fact_df.head()

,payment_key,coustomer_key,time_key,item_key,store_key,quantity,unit,unit_price,total_price
0,P026,C004510,T049189,I00177,S00307,1,ct,35.0,35.0
1,P022,C008967,T041209,I00248,S00595,1,rolls,26.0,26.0
2,P030,C007261,T03633,I00195,S00496,8,ct,12.5,100.0
3,P032,C007048,T084631,I00131,S0086,8,ct,14.0,112.0
4,P014,C006430,T071276,I00050,S00488,8,cans,8.0,64.0

In [115]:
fact_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 9 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   payment_key    1000000 non-null  object
 1   coustomer_key  1000000 non-null  object
 2   time_key       1000000 non-null  object
 3   item_key       1000000 non-null  object
 4   store_key      1000000 non-null  object
 5   quantity       1000000 non-null  int64
 6   unit           996277 non-null   object
 7   unit_price     1000000 non-null  float64
 8   total_price    1000000 non-null  float64
dtypes: float64(2), int64(1), object(6)
memory usage: 68.7+ MB

In [118]:
fact_df.isna().sum()

payment_key         0
coustomer_key       0
time_key            0
item_key            0
store_key           0
quantity            0
unit             3723
unit_price          0
total_price         0
dtype: int64

In [63]:
fact_df.dropna(inplace = True)
fact_df.isna().sum()

payment_key      0
coustomer_key    0
time_key         0
item_key         0
store_key        0
quantity         0
unit             0
unit_price       0
total_price      0
dtype: int64

In [119]:
# df = load_data()
fact_df.payment_key.duplicated().sum()

999961

In [59]:
fact_df['payment_key'] = fact_df['payment_key'].drop_duplicates(keep='first')
fact_df.isna().sum()

payment_key      996238
coustomer_key         0
time_key              0
item_key              0
store_key             0
quantity              0
unit                  0
unit_price            0
total_price           0
dtype: int64

In [32]:
fact_df.dropna(inplace = True)
fact_df.isna().sum()

payment_key      0
coustomer_key    0
time_key         0
item_key         0
store_key        0
quantity         0
unit             0
unit_price       0
total_price      0
dtype: int64

# Connection with postgreesql

In [120]:
class PostgresConnection(object):
    def __init__(self):
        self.connection = psycopg2.connect(database="ecomdb",
                                           user = "postgres",
                                           password = "123456",
                                           host = "127.0.0.1",
                                           port = "5433")

    def getConnection(self):
        print("successfully connected to database")
        return self.connection

In [121]:
con = PostgresConnection().getConnection()

successfully connected to database

# Load Data

In [122]:
#Trans_dim table 

insert_sql = "INSERT INTO ecomdb.trans_dim ( payment_key, trans_type, bank_name)" \
            " VALUES (%s, %s, %s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, insert_sql, trans_dim.values)
con.commit()
cur.close()

In [123]:
# cur = con.cursor()
# select_stmt = "SELECT t.payment_key , t.trans_type, t.bank_name " \
#               "FROM ecomdb.trans_dim t"
# cur.execute(select_stmt)
# records = cur.fetchall()

In [124]:
#store_dim table
sql_for_store = "INSERT INTO ecomdb.store_dim(store_key,division, district,upazila)"\
                "VALUES (%s , %s, %s, %s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur,sql_for_store,store_df.values)
con.commit()
cur.close()

In [125]:
#Item_dim table 

sql_for_item = "INSERT INTO ecomdb.item_dim(item_key, item_name, desc_,unit_price, man_country, supplier, unit)"\
               " VALUES (%s, %s, %s, %s, %s, %s, %s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur, sql_for_item , item_df.values)
con.commit()
cur.close()

In [126]:
# sql_for_item = "INSERT INTO ecomdb.item_dim(item_key, item_name, desc_,unit_price, man_country, supplier, unit)"\
#                " VALUES (%s, %s, %s, %s, %s, %s, %s)"

# curr = con.cursor()
# curr.execute(sql_for_item)

In [127]:
#Customer table 
sql_for_customer = "INSERT INTO ecomdb.coustomer_dim(coustomer_key,name,contact_no,nid)"\
                    "VALUES (%s,%s,%s,%s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur,sql_for_customer, customer_df.values)
con.commit()
cur.close()

#### Time table

In [128]:
#Time table 
sql_for_time = "INSERT INTO ecomdb.time_dim(time_key, date, hour , day, week , month , quarter, year)"\
               "VALUES(%s,%s,%s,%s,%s,%s,%s,%s)"
cur = con.cursor()
psycopg2.extras.execute_batch(cur,sql_for_time, time_df.values)
con.commit()
cur.close()

#### Fact date

In [129]:
sql_for_fact = "INSERT INTO ecomdb.fact_table(payment_key,coustomer_key,time_key,item_key,store_key, quantity,unit,unit_price, total_price)"\
               "VALUES(%s, %s, %s, %s,%s, %s, %s, %s, %s)"   
cur = con.cursor()
psycopg2.extras.execute_batch(cur, sql_for_fact , fact_df.values)
con.commit()
cur.close()

In [194]:
mycursor = con.cursor()
query = "SELECT payment_key ,coustomer_key FROM ecombd where unit='ct' "

In [587]:
# len(record)

In [586]:
# mycursor.execute(query)
# record = mycursor.fetchall()
# record[:20]

# Data insertion

In [199]:
mycursor.execute("INSERT INTO ecombd (coustomer_key,time_key, unit) VALUES ('C123456','T123456','BG')")

In [200]:
mycursor.execute("INSERT INTO ecombd (coustomer_key,time_key, unit) VALUES ('C78910','T78910','BG')")

In [202]:
query = "SELECT *FROM ecombd WHERE unit='BG'"

In [203]:
mycursor.execute(query)
records = mycursor.fetchall()

In [204]:
records

[(None, 'C123456', 'T123456', None, None, None, 'BG', None, None),
 (None, 'C78910', 'T78910', None, None, None, 'BG', None, None)]

In [ ]:
..